Can't keep arc element and straight line element tangent.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId LineArcTangentFailure { get; }
  Visual Basic
Public Shared ReadOnly Property LineArcTangentFailure As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ LineArcTangentFailure {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GeometryFailures Class
  Autodesk.Revit.DB Namespace